In [260]:
import numpy as np
import pandas as pd
from pydataset import data
from env import host, user, password

In [261]:
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [262]:
# df_employees = pd.read_sql('select * from employees limit 5 offset 50', url)

## 1.
Load the `mpg` dataset.

> Read the documentation for it, and use the data to answer these questions:

In [263]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [264]:
df_mpg = data('mpg')
df_mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

On average, which `manufacturer` has the best miles per gallon?

In [265]:
df_mpg = df_mpg.assign(avg_mpg = df_mpg[['cty', 'hwy']].mean(axis=1))

In [266]:
manufacturer = df_mpg.groupby(by='manufacturer')

In [267]:
manufacturer_avg_mpg = df_mpg[['manufacturer', 'avg_mpg']].groupby(
    by='manufacturer').mean()

manufac_best_mpg = manufacturer_avg_mpg.nlargest(1, columns='avg_mpg')
manufac_best_mpg

              avg_mpg
manufacturer
honda            28.5

How many different `manufacturer`s are there?

In [268]:
num_of_manufacturers = df_mpg.manufacturer.nunique()
num_of_manufacturers

15

How many different `models` are there?

In [269]:
num_of_models = df_mpg.model.nunique()
num_of_models

38

Do `automatic` or `manual` cars have better miles per gallon?

In [270]:
df_mpg['trans'] = df_mpg['trans'].str.replace('\(.*\)', '')

In [271]:
df_mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,avg_mpg
1,audi,a4,1.8,1999,4,auto,f,18,29,p,compact,23.5
2,audi,a4,1.8,1999,4,manual,f,21,29,p,compact,25.0
3,audi,a4,2.0,2008,4,manual,f,20,31,p,compact,25.5
4,audi,a4,2.0,2008,4,auto,f,21,30,p,compact,25.5
5,audi,a4,2.8,1999,6,auto,f,16,26,p,compact,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto,f,19,28,p,midsize,23.5
231,volkswagen,passat,2.0,2008,4,manual,f,21,29,p,midsize,25.0
232,volkswagen,passat,2.8,1999,6,auto,f,16,26,p,midsize,21.0
233,volkswagen,passat,2.8,1999,6,manual,f,18,26,p,midsize,22.0
234,volkswagen,passat,3.6,2008,6,auto,f,17,26,p,midsize,21.5

In [272]:
trans_avg_mpg = df_mpg[['trans', 'avg_mpg']].groupby(by='trans').mean()
trans_avg_mpg

          avg_mpg
trans
auto    19.130573
manual  22.227273

## 2.
Joining and Merging

> Copy the `users` and `roles` dataframes from the examples above. What do you think a right join would look like? An outer join? What happens if you drop the foreign keys from the dataframes and try to merge them?

## 3.
Getting data from SQL databases

Create a function named `get_db_url`. It should accept a `username`, `hostname`, `password`, and database name and return a `url` formatted like in the examples in this lesson.

Use your function to obtain a connection to the employees database.

Once you have successfully run a query:
Intentionally make a typo in the database `url`. What kind of error message do you see?
Intentionally make an error in your SQL query. What does the error message look like?

Read the employees and titles tables into two separate dataframes

Visualize the number of employees with each title.

Join the employees and titles dataframes together.

Visualize how frequently employees change titles.

For each title, find the hire date of the employee that was hired most recently with that title.

Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL and python/pandas code)

## 4.
Use your `get_db_url` function to help you explore the data from the `chipotle` database. Use the data to answer the following questions:

What is the total price for each order?

What are the most popular 3 items?

Which item has produced the most revenue?